{
    "grade": "วิทยาการคำนวน ม.1",
    "module": "วิทยาการคอมพิวเตอร์",
    "main": [
        {
            "id": 1,
            "title": "นามประธรรมกับการแก้ปัญหา"
        },
        {
            "id": 15966,
            "title": "ใช้เทคโนโลยีอย่างปลอดภัย"
        }
    ],
    "sub": [
        {
            "id": 1,
            "title": "แนวคิดเชิงนามธรรม",
            "main": 1
        },
        {
            "id": 22410,
            "title": "ภัยคุกคามจากเทคโนโลยี",
            "main": 15966
        },
        {
            "id": 23111,
            "title": "การใช้เทคโนโลยีสารสนเทศ",
            "main": 15966
        }
    ],
    "content": [
        {
            "Answer": [],
            "Choice": [],
            "Picture": [
                "https://theselfmade.asia/img/i/2651349c6ce353a85567131c4b4442b4.png"
            ],
            "id": 0,
            "content": "<p>การออกแบบการแก้ปัญหาโดยนำแนวคิดเชิงนามธรรมมาประยุกต์ใช้ จะทำให้การแก้ปัญหามีประสิทธิภาพมากขึ้น ในบทนี้จะกล่าวถึงกระบวนการในการพิจารณารายละเอียดของปัญหา ซึ่งจะนำมาสู่วิธีการแก้ปัญหา</p>",
            "sub": 1,
            "contentType": "Content",
            "Explain": "",
            "outLink": ""
        },
        {
            "Answer": [],
            "Choice": [],
            "Picture": [],
            "id": 12327,
            "content": "<p></p><p></p><p></p><p></p><p></p><p>แนวคิดเชิงนามประธรรม (Abstract thinking หรือ Abstraction) เป็นองค์ประกอบหนึ่งของแนวคิดเชิงคำนวณ (Computational thinking) ซึ่งใช้กระบวนการคัดแยกคุณลักษณะที่สำคัญออกจากรายละเอียดปลีกย่อยของปัญหา เพื่อให้ได้รายละเอียดของข้อมูลที่จำเป็นและเพียงพอในการแก้ปัญหา<br/><br/> </p>",
            "sub": 1,
            "contentType": "Content",
            "Explain": "",
            "outLink": ""
        },
        {
            "Answer": [],
            "Choice": [],
            "Picture": [
                "https://theselfmade.asia/img/i/2d837fe4585c6c369808b3b9d81228bf.png"
            ],
            "id": 79584,
            "content": "<p>จากรูปข้างบนจะเห็นคำว่า Word ลองสังเกตดูว่ามีอะไรที่แตกต่างกัน เช่นลักษณะ ขนาด หรือ สี  โดยจากรูปด้านบน คุณเห็นอะไรบ้าง </p>",
            "sub": 1,
            "contentType": "หัวข้อคำถาม",
            "Explain": "",
            "outLink": ""
        },
        {
            "Answer": [
                0,
                2,
                3,
                4,
                0,
                0
            ],
            "Choice": [
                "'สีเขียว'",
                "'สีขาว'",
                " 'สีนำเงิน'",
                " 'สีแดง'",
                " 'สีดำ'",
                " 'สีนำตาล'"
            ],
            "Picture": [],
            "id": 60741,
            "content": "<p>2.ข้อมูลประกอบด้วยตัวสีอะไรบ้าง </p>",
            "sub": 1,
            "contentType": "Choiceตัวเลือกแบบมีลำดับ",
            "Explain": "",
            "outLink": ""
        },
        {
            "Answer": [
                3
            ],
            "Choice": [
                "1",
                "2",
                "3",
                "4",
                "5"
            ],
            "Picture": [],
            "id": 42249,
            "content": "<p>จากรูปภาพให้คุณเล่มเกมส์ด้วยมองหา เจ้าแมว ได้จำนวนกี่ตัว </p>",
            "sub": 1,
            "contentType": "Choiceแบบเลือก",
            "Explain": "",
            "outLink": ""
        },
        {
            "id": 85339,
            "content": "<p>เทคโนโลยีสารสนเทศ (Information Technology : IT) เป็นเครื่องมือและมีบทบาทสำคัญต่อการเรียนรู้ และการใช้ชีวิตประจำวัน รวมทั้งสนับสนุนการดำเนินกิจกรรมต่างๆ ให้บรรลุวัตถุประสงค์ และเป้าหมายได้ อาจจะก่อให้เกิดปัญหาจากการคุกคาม การหลอกลวงผ่านเครือข่ายได้</p>",
            "sub": 22410,
            "contentType": "Content",
            "Explain": "",
            "outLink": "",
            "Answer": [],
            "Choice": [],
            "Picture": [
                "https://theselfmade.asia/img/i/b658edfbbe9610588369ff2044f14d14.png"
            ]
        },
        {
            "id": 34751,
            "content": "<p>สิ่งงานที่ไม่ได้เป็นการคิดใหม่ขึ้นมานับเป็นลิขสิทธิ์ขอเราไหมได้ไหมเพราะอะไร </p>",
            "sub": 23111,
            "contentType": "Choiceแบบเลือก",
            "Explain": "",
            "outLink": "",
            "Answer": [
                0
            ],
            "Choice": [
                "เข้าเว็บไซต์ที่ไม่รู้จัก",
                " ใช้ Wi-Fi ที่บ้าน"
            ],
            "Picture": []
        }
    ]
}